app/views/cart/_cart.html.erb

SELECT COUNT(*) FROM "orderables" WHERE "orderables"."cart_id" = $1  [["cart_id", 7]]
---
  <h1>ОтпракиTrade</h1>
  <% if @cart.orderables.count > 0 %>