app/views/cart/_orderables.html.erb

SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = $1  [["cart_id", 2]]
---
<% @cart.orderables.each do |orderable| %>