app/views/cart/show.html.erb

<h1 class="title">Список заявок</h1>
<% @cart.orderables.each do |orderable| %>
---
SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = $1  [["cart_id", 3]]