app/views/devise/registrations/new.html.erb

        <%= f.label :role %><br />
        <%= f.collection_select :role_ids, Role.where(name: ['admin', 'user']), :id, :name %>
---
SELECT "roles".* FROM "roles" WHERE "roles"."name" IN ($1, $2)  [["name", "landlord"], ["name", "tanant"]]