app/controllers/cart_controller.rb

  def add
    @logistic = Logistic.find_by(id: params[:id])
    quantity = params[:quantity].to_i
    current_orderable = @cart.orderables.find_by(logistic_id: @logistic.id)
    if current_orderable && quantity > 0
      current_orderable.update(quantity:)
    elsif quantity <= 0
      current_orderable.destroy
    else
      @cart.orderables.create(logistic: @logistic, quantity:)
---
SELECT "logistics".* FROM "logistics" WHERE "logistics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = $1 AND "orderables"."logistic_id" = $2 LIMIT $3  [["cart_id", 1], ["logistic_id", 1], ["LIMIT", 1]]
UPDATE "orderables" SET "quantity" = $1, "updated_at" = $2 WHERE "orderables"."id" = $3  [["quantity", 2], ["updated_at", "2023-12-14 14:10:32.384156"], ["id", 6]]
SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = $1  [["cart_id", 2]]
INSERT INTO "orderables" ("transport_id", "cart_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["transport_id", 1], ["cart_id", 3], ["quantity", 1], ["created_at", "2023-12-20 19:20:37.893218"], ["updated_at", "2023-12-20 19:20:37.893218"]]

  def remove
    Orderable.find_by(id: params[:id]).destroy
---
DELETE FROM "orderables" WHERE "orderables"."id" = $1  [["id", 1]]
SELECT "orderables".* FROM "orderables" WHERE "orderables"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]