app/controllers/logistics_controller.rb

SELECT "logistics".* FROM "logistics"
---
    def index
      @logistic = Logistic.all

SELECT "logistics".* FROM "logistics" WHERE "logistics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      @logistic = Logistic.find(params[:id])

INSERT INTO "logistics" ("title", "description", "price", "quantity", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
      @logistic = Logistic.new(logistic_params)
      @logistic.user = current_user

      if @logistic.save

SELECT "logistics".* FROM "logistics" WHERE "logistics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
      @logistic = Logistic.find(params[:id])